tap "bufbuild/buf"
tap "homebrew/bundle"
tap "homebrew/services"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "gettext"
brew "glib"
brew "automake"
brew "bash"
brew "binutils"
brew "ghc"
brew "cabal-install"
brew "cairo"
brew "cloc"
brew "ruby"
brew "cocoapods"
brew "docker", link: false
brew "ent"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "openjpeg"
brew "pango"
brew "gawk"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "qt"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gperf"
brew "libtool"
brew "graphviz"
brew "grep"
brew "grpcui"
brew "gstreamer"
brew "haskell-stack"
brew "help2man"
brew "krb5"
brew "lazygit"
brew "libfido2"
brew "libssh2"
brew "llvm"
brew "luarocks"
brew "protobuf"
brew "mysql", restart_service: true
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openblas"
brew "openssl@1.1"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qt@5"
brew "r"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rust-analyzer"
brew "sl"
brew "texinfo"
brew "texlive"
brew "tmux"
brew "tree"
brew "w3m"
brew "wasmtime"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "bufbuild/buf/buf"
cask "alacritty"
cask "android-studio"
cask "audacity"
cask "docker"
cask "dotnet"
cask "flutter"
cask "gimp"
cask "inkscape"
cask "mactex-no-gui"
cask "openmsx"
cask "r"
cask "rectangle"
cask "rstudio"
cask "visual-studio-code"
cask "warp"
vscode "ayakosky.sodagreen-theme"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kuscamara.remove-unused-imports"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nucllear.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "tauri-apps.tauri-vscode"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhang-renyang.vscode-react"
